import pandas as pd
import numpy as np
from tqdm import tqdm

tmp_gu_dict = {
    '수원': ['장안구', '권선구', '팔달구', '영통구'],
    '성남': ['수정구', '중원구', '분당구'],
    '안양': ['만안구', '동안구'],
    '안산': ['상록구', '단원구'],
    '고양': ['덕양구', '일산동구', '일산서구'],
    '용인': ['처인구', '기흥구', '수지구'],
    '청주': ['상당구', '서원구', '흥덕구', '청원구'],
    '천안': ['동남구', '서북구'],
    '전주': ['완산구', '덕진구'],
    '포항': ['남구', '북구'],
    '창원': ['의창구', '성산구', '진해구', '마산합포구', '마산회원구']
}


def ID(df):
    si_name = [None] * len(df)
    # 광주광역시,대구광역시,대전광역시,부산광역시,서울특별시,울산광역시,인천광역시
    for i in tqdm(df.index):
        if df['시도명'][i][-3:] in ['광역시', '특별시']:
            if len(df['시군구명'][i]) == 2:
                si_name[i] = df['시도명'][i][:2] + ' ' + df['시군구명'][i]
            else:
                si_name[i] = df['시도명'][i][:2] + ' ' + df['시군구명'][i][:-1]

        # 세종특별자치시
        elif df['시도명'][i] == '세종특별자치시':
            si_name[i] = '세종'
        # 제주특별자치도
        elif df['시도명'][i] == '제주특별자치도':
            # 요거 잘못함. '제주' 가 아니라 '제주시'로 들어가 있음
            if len(df['시군구명'][i]) == 3:
                si_name[i] = '제주'
            else:
                si_name[i] = '서귀포'

        # 강원도, 경기도
        elif df['시도명'][i][:-1] == '도' and len(df['시도명'][i]) == 3:
            if len(df['시군구명'][i]) == 2:
                si_name[i] = df['시도명'][i][:-1] + ' ' + df['시군구명'][i]
            else:
                si_name[i] = df['시도명'][i][:-1] + ' ' + df['시군구명'][i][:-1]

        # 경상남도, 경상북도, 전라남도, 전라북도, 충청남도, 충청북도
        elif df['시도명'][i][:-1] == '도' and len(df['시도명'][i]) == 4:
            if len(df['시군구명'][i]) == 2:
                si_name[i] = df['시도명'][i][::2] + ' ' + df['시군구명'][i]
            else:
                si_name[i] = df['시도명'][i][::2] + ' ' + df['시군구명'][i][:-1]

        # 그 외 안산시, 수원시, 고양시, 성남시, 안양시, 용인시, 창원시,포항시,전주시,천안시, 청주시
        # 딕셔너리

            # 강원 고성, 경남 고성, 덮어씌워지므로 조건문 위치 문제 없음
        else:
            if df['시군구명'][i][:-1] == '고성':
                if df['시도명'][i][:-1] == '강원':
                    si_name[i] = '고성(강원)'
                else:
                    si_name[i] = '고성(경남)'
            # 요거 잘못함
            else:
                si_name[i] = df['시군구명'][i][:-1]

            for key, value in tmp_gu_dict.items():
                if df['시군구명'][i] in value:
                    if len(df['시군구명'][i]) == 2:
                        si_name[i] = key + ' ' + df['시군구명'][i]
                    elif df['시군구명'][i] in ['마산합포구', '마산회원구']:
                        si_name[i] = key + ' ' + df['시군구명'][i][2:-1]
                    else:
                        si_name[i] = key + ' ' + df['시군구명'][i][:-1]
